[
{"text": "„Patnáct stovek stojí stočení čísla na tachometru, za tři a půl tisíce vymažu údaj o počtu ujetých kilometrů ze všech pamětí auta. To už je složitější, ale nedohledatelné,“ popisuje třicetiletý Patrik z jihočeského Písku při obhlídce dvanáct let starého opela. Stočit kilometry nebude problém. „Já se ničeho nedopouštím, já jen upravuju stav, abyste se jako řidič díval na milejší čísla. Trestného činu se dopouštíte až vy při prodeji, když to zatajíte,“ uculí se. Stočených vozidel je v Česku zhruba čtyřicet procent a test MF DNES ukazuje, že nechat si upravit tachometr je jednoduché – inzerátů na internetu jsou desítky.„Značka auta? Rok výroby? A je to automat, nebo má manuální převodovku?“ ptá se do telefonu další „mechanik“, Martin z Teplic. Víc ho nezajímá. Pak řekne, že se podívá, jestli starý passat dokáže přetočit, a slibuje, že se za chvíli ozve. Netrvá to ani minutu a volá zpátky.„Jo, jde to. A bude to stát litr,“ říká. Stačí mu k tomu jen notebook, dílnu nepotřebuje a nabízí, že za zákazníkem dojede kamkoli. Stav tachometru stařičkého passatu ho nezajímá, ani to, o kolik ho chce zákazník přetočit a proč.O desítky tisíc drážPolicie Středočeského kraje udělala letos za první polovinu roku zkoušku – prohlédla tisícovku automobilů s tím, že u čtyř set z nich bylo evidentní, že s počtem ujetých kilometrů někdo manipuloval. Rekordmanem bylo vozidlo, které bylo stočeno o neuvěřitelných 400 tisíc kilometrů.„Cílem akce není pouze odhalení této nelegální činnosti a zahájení trestního stíhání konkrétních osob, ale také upozornění na tento problém a zlepšení povědomí občanů, kteří do nákupu vozidla investují nemalé částky,“ uvedl mluvčí Krajského ředitelství policie Středočeského kraje Zdeněk Chalupa.Auto se stočeným tachometrem lze prodat o desítky tisíc dráž. To je také důvod, proč to lidé dělají. Firmy nabízené služby nijak nemaskují přes rozhodnutí Nejvyššího soudu, že prodej auta s úmyslně sníženým počtem ujetých kilometrů je trestný čin podvodu, neboť prodávající kupce klame. Za to hrozí až pět let nebo až půlmilionová pokuta.Firmy se ničeho nedopouštějíFirmy se „jistí“ jednoduchým upozorněním – tachometry stočí jen lidem, kteří nemají v úmyslu vozidlo po úpravě prodat, a chtějí písemný souhlas. „Upozorňujeme, že počítadlo kilometrů není podle zákona státem cejchovanou mírou, a proto je možné jeho hodnoty libovolně upravovat. Veškeré úpravy tachometru provádíme za účelem opravy nebo výměny tachometru (jednotky). Pokud provedete snížení počtu najetých kilometrů vozidla, je vaší povinností tuto skutečnost nahlásit při jeho prodeji, jinak se můžete dopustit trestného činu podvodu,“ píše například na svých stránkách firma Car diagnostik.Firmy mají pravdu, když tvrdí, že se ničeho nedopouštějí. „Samotné stáčení tachometru není zákonem podchyceno,“ potvrzuje mluvčí České obchodní inspekce (ČOI) Jiří Fröhlich. „Podvodem je až prodej auta se změněným stavem tachometru,“ dodává.Loni pracovníci ČOI při kontrolní akci v autobazarech prověřili 27 aut, přetočený tachometr mělo 9 z nich, předloni to zjistili u 21 aut ze 40. Šlo třeba o Škodu Octavii 1,9 TDI, která měla v srpnu 2016 na palubce uvedeno 188 tisíc ujetých kilometrů, při opravě v únoru 2012 byl přitom stav 309 tisíc.Pas pro autoPolitici teď chtějí stáčení tachometrů zabránit tím, že chtějí, aby každé vozidlo mělo svůj Car-Pass. Průkazku, do které by se při servisech a technických kontrolách počet ujetých kilometrů povinně zapisoval. Stejný systém funguje v Belgii.Ověření stavu tachometruMinisterstvo dopravy na webu www.kontrolatachometru.cz zpřístupňuje databázi údajů o počtu najetých kilometrů z poslední technické kontroly. K vyhledání je potřeba znát VIN vozu a číslo protokolu technické prohlídky (obojí je v technickém průkazu).Europoslanec Tomáš Zdechovský z KDU-ČSL spolu s místopředsedou parlamentního výboru pro dopravu Ondřejem Polanským z Pirátů chtějí systém zavést i u nás. Podle ředitele tamní neziskové organizace Car-Pass, která systém provozuje, Michela Peelmana, má stočený tachometr v Belgii jen 0,2 procenta vozidel. Loni to bylo 1 557 automobilů, před rokem 2004 pak mezi 50 až 100 tisíci aut ročně.„Osobní auta v Česku jsou v průměru stočená o 130 tisíc kilometrů, dodávky pak o více než 200 tisíc. Největší problém je s auty z dovozu, proto je nutná spolupráce a vzájemná výměna dat mezi všemi státy,“ řekl Zdechovský. Od října také bude díky nové legislativě možné uložit za stočení tachometru pokutu až půl milionu korun jak fyzické osobě, tak firmě.Společnost Cebia, která prověřuje historii vozidel, odhaduje, že na trhu je 42 procent vozidel, která mají jiný počet ujetých kilometrů, než kolik zobrazuje tachometr. „Vzhledem k ziskům, které stáčení tachometru nepoctivým prodejcům přináší, nelze čekat, že se přestanou s novou legislativou auta se stočeným tachometrem prodávat,“ říká ředitel společnosti Cebia Martin Pajer a rovnou dodává, že má obavy, jak rychle se v Česku podaří projekt průkazem Car-Pass zavést. „Vzhledem k rozdílné legislativě v jednotlivých evropských zemích nebude realizace na mezinárodní úrovni vůbec snadná,“ dodal Pajer.Cebia už nyní disponuje více než 100 miliony záznamů tachometrů zhruba sedmi milionů automobilů ve svém programu a je ochotna v případě spuštění českého Car-Passu je do systému překlopit.Samozřejmě ani tato čísla nejsou zárukou, že u některých aut v minulosti – hlavně po převozu ze zahraničí – nedošlo ke stočení tachometru před první registrací v Česku.Stotisícová pokutaV Belgii ročně do systému přibude okolo patnácti milionů zápisů, které tam pořizují úředníci odborů dopravy, technické kontroly i servisy. Car-Pass přitom obsahuje pouze výrobní číslo vozu, takzvané VIN. Vystavení certifikátu o počtu ujetých kilometrů stojí v Belgii 7,30 eura, tedy v přepočtu 190 korun.Předseda Sdružení na ochranu vlastníků automobilů SOVA Zbyněk Veselý ale už nyní varuje, že prodejci starších vozů vymysleli způsob, jak i přes různé záznamy kilometrů z minulosti tachometr stočit. Tvrdí, že stáčejí kilometry ke stavu, který byl naposledy zaznamenán zahraniční či tuzemskou stanicí technické kontroly, a tvrdí, že s autem prakticky nejezdili.Zároveň se objevily vůbec první rozsudky soudů, které trestají za stáčení tachometrů. Kupříkladu Městský soud v Brně potrestal soukromou firmu, že „odmazala“ na tachometru Škody Octavia – kterou prodávala – minimálně 59,5 tisíce kilometrů, aby auto mělo najeto 135 tisíc kilometrů. „Při prodeji vozu za částku 249 tisíc korun s cílem dosažení neoprávněného prospěchu způsobila poškozené škodu ve výši nejméně 58 tisíc korun odpovídající neoprávněně navýšené hodnotě vozidla,“ napsal do rozsudku soudce Ivo Zummer a udělil firmě pokutu 116 tisíc korun a povinnost kupující zaplatit ještě 58 tisíc korun rozdílu.", "opener": "Až čtyřicet procent tachometrů ojetých vozů v Česku je stočených. Reportéři MF DNES si ověřili, jak je to snadné. Za pár minut a za pár stovek. Na počkání, přes počítač, bez demontáže tachometru.", "disc_nr": 346, "authors": "Autoři: Václav Janouš, Artur Janoušek", "images": [], "discussion_url": "https://zpravy.idnes.czhttps://www.idnes.cz/zpravy/domaci/stocena-auta-tachometr-pretoceny-ojeta-auta-podvod.A180920_094019_domaci_kuce/diskuse&razeni=time"}
]