[
{"mentions": [], "author": "Anonymous", "id": "1541220", "ts": "1550065954", "text": "Just a thread for anyone to talk about their experiences traveling/living in Vietnam. I'm off to Hoi An and Saigon in a few days, getting excited to see the joint find some commie propaganda posters and some good street food."},
{"mentions": [], "author": "Anonymous", "id": "1541230", "ts": "1550067716", "text": "Just to add like I do on the occasions that I catch one of these threads that north of Hanoi is the most beautiful part of the country by a mile and also the least touristy other than Sapa so don't miss it."},
{"mentions": [], "author": "Anonymous", "id": "1541368", "ts": "1550087802", "text": "Just how touristic is Ninh Binh?"},
{"mentions": [], "author": "Anonymous", "id": "1541376", "ts": "1550089348", "text": "I have been to saigon. If your main attraction is the commie propaganda and history you will love it.If you walk around you might catch some rooms where there are statues of ho chi minh with guards there at all times. It is truly bizarre. As a history site it is definitely amazing. I did not get too much into the night life so I can't comment on that but the food was all right I guess."},
{"mentions": [], "author": "Anonymous", "id": "1541377", "ts": "1550089536", "text": "I miss my bike guys."},
{"mentions": ["1541377"], "author": "Anonymous", "id": "1541462", "ts": "1550100696", "text": "Fuck i feel that. Here's my bike, I miss her dearly. I named here Mathilda."},
{"mentions": [], "author": "Anonymous", "id": "1541467", "ts": "1550101038", "text": "Im planning on going to Hanoi in a few days (if i dont go to maui) and wanted to buy a motorbike and rip the scenic routes of the north. Does anyone have any advice for buying a bike and doing this ( I know how to ride) Also is there good clubs around Hanoi for dancing? Also considering crossing overland by bus/van into Laos and then Thailand"},
{"mentions": ["1541220"], "author": "Anonymous", "id": "1541480", "ts": "1550102886", "text": ">north of Hanoi is the least touristyWhat worthwhile activities are there to do north of Hanoi? Usually if there aren't any tourists it's because there's nothing unique or remarkable to see."},
{"mentions": ["1541368"], "author": "Anonymous", "id": "1541652", "ts": "1550127616", "text": "It’s pretty touristy. If you take the boat, they’ll stop and force you to buy things from other people in boats. They like to yell until you pay a “parking fee” in random areas. Old ladies running around with their hands out yelling “Mony for Vietnam! Mony for Vietnam!” The mountains are pretty beautiful though."},
{"mentions": [], "author": "Anonymous", "id": "1541680", "ts": "1550130644", "text": "I'll be doing a medical rotation in Ho Chi Minh City for a month. I'll have a translator for when I see patients but that's it. I don't know any Viet. How easy would it be to get around the city and communicate with people?"},
{"mentions": ["1541680"], "author": "Anonymous", "id": "1541683", "ts": "1550131517", "text": "You only need to point and count fingers. Say “cam on.” Lots of young people speak English though."},
{"mentions": ["1541376"], "author": "Anonymous", "id": "1541700", "ts": "1550134255", "text": "Awesome sounds good to me, I'm always a slut for history."},
{"mentions": ["1541480"], "author": "Anonymous", "id": "1541809", "ts": "1550161166", "text": ">Usually if there aren't any tourists it's because there's nothing unique or remarkable to see.imagine actually being this braindead.Must be a woman."},
{"mentions": [], "author": "Anonymous", "id": "1541829", "ts": "1550163971", "text": "hows the pussy in vietnam"},
{"mentions": ["1541829"], "author": "Anonymous", "id": "1541844", "ts": "1550166211", "text": "So tite."},
{"mentions": ["1541844"], "author": "Anonymous", "id": "1541858", "ts": "1550168290", "text": "nice"},
{"mentions": [], "author": "Anonymous", "id": "1541890", "ts": "1550175808", "text": "Traveled through north and mid Vietnam this summer. Absolutely gorgeous. A big thank you to the anon on this site who tipped me of Phong Nha and the caves"},
{"mentions": ["1541377", "1541462"], "author": "Anonymous", "id": "1541891", "ts": "1550175965", "text": "I miss mine. Not in Vietnam though. Next door.Soon..."},
{"mentions": ["1541652"], "author": "Anonymous", "id": "1541904", "ts": "1550179130", "text": "I assume not many people bother you if you just rent a bike or scooter and ride around? Tips for renting one?"},
{"mentions": ["1541652"], "author": "Anonymous", "id": "1541907", "ts": "1550179503", "text": "I was there too weeks ago and none of this happened. Ninh Binh was touristy but really cool. Not crowded either though it was right before Tet"},
{"mentions": ["1541809"], "author": "Anonymous", "id": "1541959", "ts": "1550188200", "text": "Feel free to prove me wrong"},
{"mentions": [], "author": "Anonymous", "id": "1542292", "ts": "1550240114", "text": "i'm being told there is a lot of crime and danger in vietnam, is that true?"},
{"mentions": ["1541904"], "author": "Anonymous", "id": "1542301", "ts": "1550241969", "text": "Renting a bike in Vietnam is incredibly easy. You don't really need any tips other than don't be an idiot so go with a place that offers a proper helmet."},
{"mentions": ["1542301"], "author": "Anonymous", "id": "1542425", "ts": "1550263007", "text": "Any scams I could risk?"},
{"mentions": ["1542292"], "author": "Anonymous", "id": "1542765", "ts": "1550308873", "text": "No. Just people that snatch phones and steal helmets off of motorbikes."},
{"mentions": ["1542765"], "author": "Anonymous", "id": "1542847", "ts": "1550324251", "text": "huhmy cousin told me that its hard to trust people and she's scared of getting kidnapped and sold to china she's only 15 so i kind of assume she's just been scared by her parents to believe that, not that they're wrong to do so"},
{"mentions": ["1541220"], "author": "Anonymous", "id": "1543004", "ts": "1550340849", "text": "Dont go if you are white and not surrounded by armed security guards.Thats all you need to know"},
{"mentions": ["1542847"], "author": "Anonymous", "id": "1543268", "ts": "1550371728", "text": "Yeah that shit doesn't happen to tourists, honestly it doesn't happen to Vietnamese either it's mostly minorities who live near the border."},
{"mentions": ["1541368"], "author": "Anonymous", "id": "1543533", "ts": "1550417430", "text": "It's a big area so if you have a bike you can drive to areas further away from the tourist centres that are very beautiful in their own right. I drove for a day doing a wide loop around the area and basically didn't see any tourists at all. If you go via public transport you won't be able to get away from it as much though."},
{"mentions": ["1542847"], "author": "Anonymous", "id": "1543579", "ts": "1550425720", "text": "It's a legit fear. Dozens of young travellers have been kidnapped. Mainly Americans and Polacks."},
{"mentions": ["1543004"], "author": "Anonymous", "id": "1543594", "ts": "1550427421", "text": "you are retarded, I'm white and I backpacked on my own from Saigon to Hanoi in three weeks and was safe as fuck, don't be a pussy."},
{"mentions": ["1541467"], "author": "Anonymous", "id": "1543607", "ts": "1550428642", "text": ">advice for buying a bikemake sure you do your research so you don't pay foreigner price. Facebook is a good place to look.>clubs for dancingSavage bar but it's expensive as fuck and 80% expats. Also Tom's bar is okay but full of hookers and niggers (the only place in Vietnam there are this many and by that I mean like 4 in one room).>cross overland by bs/van into Laos and then Thailandenjoy sitting in a bus for over 24 hours and paying extra $10 in bribes for your visa when you cross over. If you get the cheapest flight possible it's about the same price overall since the visa when you go by plane is free for most countries. Depends where in the country you want to go. Buses from Laos to Thailand are common because people there are poorer and can't afford flights, so I imagine the roads are better than between Vietnam but I haven't done that.The main cities in Laos are also nearer to Thailand so that would probably be a bit better."},
{"mentions": ["1543615"], "author": "", "id": "1543618", "ts": "1550429636", "text": "你们是什么样子"},
{"mentions": ["1541220"], "author": "Anonymous", "id": "1545736", "ts": "1550756245", "text": "I'm going in a few days too. Flying into Hanoi then train to Danang then train to Saigon and leave, I enjoy seeing countries by train"},
{"mentions": ["1543612", "1543618"], "author": "Anonymous", "id": "1545738", "ts": "1550758108", "text": ""},
{"mentions": [], "author": "Anonymous", "id": "1546090", "ts": "1550808724", "text": "Can I get away with bringing just 3 outfitsAlso can somebody recommend good clothes to bring, I was thinking 3 pairs of shorts and 3 shirts. I'm from Queensland Australia so I essentially wear this outfit all year round with maybe a jacket in the guts of winter.I can't stand going to Reddit for advice I swear they are all brand-obsession bug people jerking off over their merino"},
{"mentions": [], "author": "Anonymous", "id": "1546156", "ts": "1550821826", "text": "How are women in Vietnam? I heard they're pretty conservative and are usually only looking for long term relationships. Would I be able to meet someone willing to come back with me to the states? I'm an Asian guy with no luck here in the US."},
{"mentions": [], "author": "Anonymous", "id": "1546169", "ts": "1550824183", "text": "Does anyone know of a good way to find software dev or IT related jobs for expats in Vietnam? I could find jobs, but they pay rather low and I'm making USD4500/month in PH right now so I was hoping for something comparable in Vietnam because PH is very soso apart from work."},
{"mentions": ["1546090"], "author": "Anonymous", "id": "1546170", "ts": "1550824277", "text": "I usually bring 6 shirts, 2 pairs of shorts so that I only have to wash once a week."},
{"mentions": ["1542425"], "author": "Anonymous", "id": "1546171", "ts": "1550824503", "text": "I went for the cheapest and my breaks, lights and fuel gauge were broken :) Didn't die, saved several €!"},
{"mentions": [], "author": "Anonymous", "id": "1547505", "ts": "1551062228", "text": "I'll be in Vietnam for 12-14 days. I was planning on Hanoi, Halong bay, Ninh Binh, Sa Pa, and Ha Giang. How would you divide up your time in those areas if you were me? Also is there a place you'd remove or add to that list?"},
{"mentions": ["1541377", "1541467", "1542292"], "author": "Anonymous", "id": "1547524", "ts": "1551065735", "text": "Same.\"Beer corner\" is the happening spot. Chill tourist bars and loud clubs alike. Also, there are N2O tanks everywhere, people straight up do whippets openly. I highly recommend giving it a go. Not at all. I never experienced or saw any crime or anything threatening or suspicious. Also Vietnamese people are really small so it's kinda hard to feed threatened lol"},
{"mentions": ["1541230"], "author": "Anonymous", "id": "1547629", "ts": "1551083255", "text": "100% agree, Ha Giang province was the highlight of my trip"},
{"mentions": [], "author": "Anonymous", "id": "1548071", "ts": "1551160862", "text": "I'm going to Korea in the summer, but looking at round trip flights from Korea back to the US it's expensive. So I looked at going from Korea to Vietnam for 4 days then from Vietnam back to US and the flight prices are about the same.So I think I'm gonna do that, with 4 days in Vietnam what would you recommend? Note, I do plan to go back to Vietnam for a proper trip in the future"},
{"mentions": ["1548071"], "author": "Anonymous", "id": "1548216", "ts": "1551189666", "text": "Just stay in whatever city the flight is from."},
{"mentions": ["1547505"], "author": "Anonymous", "id": "1548296", "ts": "1551207036", "text": "Pls responder"},
{"mentions": ["1548071"], "author": "Anonymous", "id": "1548300", "ts": "1551207539", "text": "Which city?"},
{"mentions": ["1548296"], "author": "Anonymous", "id": "1548304", "ts": "1551208081", "text": "2 days in Ha Long bay should be plenty, 3 in Hanoi and at least 3 in Sa Pa"},
{"mentions": ["1548216", "1548300"], "author": "Anonymous", "id": "1548321", "ts": "1551211979", "text": "Ho Chi Minh most likely"},
{"mentions": ["1541220"], "author": "Anonymous", "id": "1548336", "ts": "1551216305", "text": "Pls watch out for the street food.>in Saigon, drunk>Buy pork baguette and can of cola off the back of a scooter for pennies>little prick that sold it to me grinning like fuck>brag to my mates \"CaN YOu BeLIeve tHE PRiCE of FOOd HErE\">mates all buy freshly made pizza from another stall >Next morning flight to Da Nang >something aint right>spend the next 5 days googling Japanese Encephalitis symptoms as I shit my pants and slowly die with migrainesFYI - beach in Da Nang is stunning even with severe food poisoning"},
{"mentions": [], "author": "Anonymous", "id": "1548350", "ts": "1551219205", "text": "Land of scams and petty crime. Rude locals.I don’t know why this shithole has gotten so popular with backpacker millennials and zoomer white kids lately. The girls aren’t even easy, and you only ever see white guys with ugly as fuck or fat brown Viet girls. The sights and cities are meh, you can find the same thing in Thailand or Cambodia."},
{"mentions": ["1548350"], "author": "Anonymous", "id": "1548385", "ts": "1551224171", "text": "I lived in central VN for three years and I finally had to leave because I couldn't take every interaction with another human feeling like an exchange with a sleazy used car salesman. Food is also some of the most overrated in the world, Thailand blows it out of the water"},
{"mentions": ["1548390"], "author": "Anonymous", "id": "1548397", "ts": "1551226094", "text": "I stayed because there are a few things that I like a lot, such as thuoc lao and bia hoi. To be honest I was kind of in denial about my situation, and I thought I could make it work if I just tried a little harder. I finally broke after travelling to Laos and Thailand and realizing that there were better alternatives. Moved to Udon Thani and never looked back.The southern Vietnamese are nice enough, and on the whole a lot easier to deal with. I blame a lot of the scumminess found in the central/north on the Sino influence, along with a lack of critical thinking skills fostered by their shitty educational system and a vain materialism that can be found in any society where people are just getting access to wealth"},
{"mentions": [], "author": "Anonymous", "id": "1548943", "ts": "1551340824", "text": "After two full days in Saigon I'm thinking about going back to Thailand or somewhere else in a few days. The city is so fucking chaotic, and you can't find refuge. Although the parks at night are cool. What's up with the motorbikes trying to run you down on the sidewalk, why the fuck do they allow this?"},
{"mentions": ["1548397"], "author": "Anonymous", "id": "1548982", "ts": "1551347726", "text": "Interesting. I've been in Thailand for about 3 years and I'm thinking of relocating to Vietnam for reasons similar to yours. My every interaction with people here isn't sleazy used care salesman type, but it just feels like they're not trying very hard to even reach bare minimum. That and the relentless pollution with all the burning and whatnot. What was air quality like in central VN? I live in Chiang Mai where it's exceptionally bad this time of year. I've been to Udon Thani twice and found it to be a braindead town full of rubber-tapping alcoholics who couldn't tie their shoelaces but were very capable of wailing out 2AM renditions of \"my buffalo died, my wife ran away\". Wasn't there a story like 2 years ago about a gang of Udon youths who dug up a fresh mass grave of dogs so they could eat them, only to end up in the hospital getting rabies jabs because the dogs were rabid mutts who were put down by the local government and just dumped in a random field? Feels to me like Thailand combines the worst bits of rapidly advancing modernity together with the worst bits of leftover stone-age moronic values and ideas. At least in places like Laos you've still got the novelty of being in the thick of the jungle and although there may be dickheads at least unlike Thais they're too poor to translate their stupidity into widespread damage by fast cars on long stretches of road, getting tanked up on booze/meth, shallow nationalistic sentiments, fragile male egoes, food loaded with pesticides, lazy wasteful burning of carcinogenic plastic garbage, etc etc. Is Vietnam the same? I'm oscilating between relocating to Vietnam or Taiwan right now."},
{"mentions": ["1549002"], "author": "Anonymous", "id": "1549021", "ts": "1551350929", "text": ">please share more storiesno need, just go to any Thai news website and half of what you read will blow your tits clean off guaranteedanyway, this is a VN thread. hoping it's nothing like this over there"},
{"mentions": ["1541462", "1541377", "1541891"], "author": "Anonymous", "id": "1549109", "ts": "1551369740", "text": "where are you able to rent these bikes? or did you buy and re sell them?"},
{"mentions": ["1549109"], "author": "Anonymous", "id": "1549120", "ts": "1551371379", "text": "There’s places all over renting and selling. I recommend buying one and selling it for the same price at the end of your trip. I bought mine from a rental guy and sold it on Facebook."},
{"mentions": ["1543579"], "author": "Anonymous", "id": "1549392", "ts": "1551409911", "text": "you're lying. it's simply not true. quit spreading fear. stay at home in your mom's basement if the outside world is so scary. i lived in vietnam for almost 6 years and never once felt threatened, anywhere in the country. and i did some incredibly dumb shit."},
{"mentions": ["1543607"], "author": "Anonymous", "id": "1549394", "ts": "1551409976", "text": "Savage bar but it's expensive as fuck and 80% expats. Also Tom's bar is okay but full of hookers and niggers (the only place in Vietnam there are this many and by that I mean like 4 in one room).>the only place in Vietnam where there are 4 hookers in one room lol"},
{"mentions": ["1546156"], "author": "Anonymous", "id": "1549395", "ts": "1551410070", "text": "tinder is a thing. badoo.com, tagged.com. you can meet girls in tourist bars bars but if they're hanging out by themselves and agree to go home with you then you'll probably have to pay them. generally girls in saigon hanoi and danang aren't as conservative as the countryside."},
{"mentions": ["1546169"], "author": "Anonymous", "id": "1549397", "ts": "1551410138", "text": "just had to brag didn't you. To answer your question: yeah there's a lot of tech dev jobs in hanoi and saigon. vietnamworks.com is one place to look."},
{"mentions": ["1548982"], "author": "Anonymous", "id": "1549430", "ts": "1551419309", "text": "I've been living in Hanoi for more than a year. Don't go central, its good for a holiday but not to live unless you like being bored shitless. Hanoi has everything I could want, good food, small so easy to travel around (if you have a xe may/ motorbike). I find the used car salesman only happens if you look for it in the really touristy areas. Before I even landed here I had a job waiting for me and a few girls. Life is easy here although we also have the 2AM renditions of \"my buffalo died, my wife ran away\"."},
{"mentions": ["1549439"], "author": "Anonymous", "id": "1549449", "ts": "1551424437", "text": "Probably Da Nang. Nha Trang and Mui Ne are big tourist beach towns but I’m not sure about the job market."},
{"mentions": [], "author": "Anonymous", "id": "1549469", "ts": "1551429986", "text": "you're only really gonna be an English teacher in Vietnam. sorry kids. Unless you can land a job working with a foreign company then you can't get an IT job working for Vietnamese. They simply do not know enough English to hire you. The English in Vietnam is really bad unless you talk to the young people. Vietnam is a great country. The girls love Westerners but they aren't easy lol. They will date you but you'll have to be with them for at least a year for anything to go down. They ain't gonna sleep with you during your short stay in Nam. If they do then you found a girl who sleeps with many men or she's a hooker of some sort."},
{"mentions": ["1546156"], "author": "Anonymous", "id": "1549472", "ts": "1551430088", "text": "sadly my friend. Vietnamese girls like White men. Not to say you won't have a chance but you really gotta show them that you aren't like all the other Asian men. The reason why they don't like Asian guys is because they say Asian men are too controlling. They might be put off by your Asian looks despite you being American and just assume you are like the Viet guys :("},
{"mentions": [], "author": "Anonymous", "id": "1549475", "ts": "1551431156", "text": "What's the perfect 30 days itinerarySo far I have Sa pa,Hanoi,Hoi,Hue,Da Nang and Saigon on my mindAlso is 1000 USD enough considering I don't need visa and shit"},
{"mentions": ["1549472"], "author": "Anonymous", "id": "1549477", "ts": "1551431241", "text": "That's pretty retarded As far as I know white guys are an accessory or an ATM while they have a local guy in a serious oneThere's a certain negative stigma in dating Whiteys there"},
{"mentions": ["1549477"], "author": "Anonymous", "id": "1549479", "ts": "1551431551", "text": "In my experience it's the opposite. Vietnam worships white people because they see white people are their only saving grace against the big evil China which is their arch enemy.The Asian women dating white guys are the liberal open minded ones that have seen western movies and know western females have freedom and equality. They want to be free and equal to men as well. So they are attracted to white guys because they assume white guys will treat them better and give them more freedom. The irony of the situation is that the white guys that go for vietnamese girls are usually conservative incels. The exact opposite of what they wanted."},
{"mentions": ["1549479"], "author": "Anonymous", "id": "1549499", "ts": "1551435734", "text": ">they see white people are their only saving grace against the big evil ChinaAah.This incel again....Yeah... there are geopolitical concerns in Western - Viet relationships. Sounds plausible... that you are a complete retard."},
{"mentions": ["1549430", "1549449"], "author": "Anonymous", "id": "1549667", "ts": "1551460175", "text": "I think Saigon is your best bet for being close to beaches and having lots of work. I couldn't handle the constant heat so I stayed north.Best tourist city for beaches is def Da Nang. Its were I first learned to ride a scooter and its not too crowded, I remember going at night with my Viet ex to the beach, sipping fresh cold coconut under the soft moonlight... Da Nang sucks for jobs, everyone wants to work there"},
{"mentions": ["1548350"], "author": "Anonymous", "id": "1549670", "ts": "1551460847", "text": "based"},
{"mentions": ["1549472"], "author": "Anonymous", "id": "1549672", "ts": "1551461277", "text": ">sadly my friend. Southeast Asian girls like White men.ftfy"},
{"mentions": [], "author": "Anonymous", "id": "1549915", "ts": "1551510856", "text": ">go to KL Malaysia>Expecting friendly multilingual Malay people>Mostly encounter weird, autistic homoerotic indians who look at you funnyAny cool spots to see in KL?"},
{"mentions": ["1549395", "1543607", "1541467", "1547524", "1541829", "1541844"], "author": "Anonymous", "id": "1549925", "ts": "1551514210", "text": "I have heard that you cannot simply take a Vietnamese girl to your hotel, and if they try to do, the receptionists ask for a marriage certificate or deny letting her in. Is this really the case? If so, how to circumvent this issue?"},
{"mentions": ["1549925"], "author": "Anonymous", "id": "1549926", "ts": "1551514325", "text": "Not true, that's Laos"},
{"mentions": ["1548350"], "author": "Anonymous", "id": "1549930", "ts": "1551515087", "text": "Lived here for a year... rude locals is your opinion I guess but the stuff about on my being able to get ugly girls is objectively false. They love white guys here."},
{"mentions": ["1549925"], "author": "Anonymous", "id": "1549939", "ts": "1551517571", "text": "I had some hotels try to stop me. I just had the girl pretend to not speak Vietnamese which was always pretty funny. Most of them had some other random ID to give the desk. This was family hotels. Big ones and love hotels probably don’t care."},
{"mentions": ["1549925"], "author": "Anonymous", "id": "1549941", "ts": "1551517714", "text": "I stayed at one where the guy didn’t give a shit when I brought her back but in the morning, the lady came screaming at us “YOU CHECK OUT FIVE MINUTE!” and almost didn’t give the girl back her ID."},
{"mentions": ["1549915"], "author": "Anonymous", "id": "1549944", "ts": "1551517829", "text": "Batu caves. There’s a small cinema that shows art films every weekend and has cheap beer. Forgot the name."},
{"mentions": [], "author": "Anonymous", "id": "1549967", "ts": "1551523177", "text": "How is the poverty in Saigon and Hanoi?How about rural parts?"},
{"mentions": ["1549967"], "author": "Anonymous", "id": "1549970", "ts": "1551523815", "text": ">Saigona little better than say Jakarta and Manila but poverty is still very visible>Hanoikinda insignificant but that's probably because it's an elite city and most poorfags are kicked out.I'd still prefer Saigon because unlike Hanoi, most people are very friendly. Fuck Hanoians"},
{"mentions": ["1549970"], "author": "Anonymous", "id": "1549976", "ts": "1551524567", "text": "It's not that bad in Saigon, cant compare to manila and Jakarta cos I've never been but it's a fuck of a lot better than Phnom Penh."},
{"mentions": [], "author": "Anonymous", "id": "1550003", "ts": "1551527609", "text": ">convo with local>asks how to say \"girl\" in Vietnamese>him:\"Oh no, no I am man, haha\">me:\"no I mean, what is the Vietnamese word for girl?\">him: \"oh you want know how to say my name?\">me: \"no, no, I mean how do you say the word \"girl\" in Vietnamese?\">him:\"oh yes many girls here in Vietnam speak good English yes not all but many young yes you looking for girl?\""},
{"mentions": ["1550003"], "author": "Anonymous", "id": "1550027", "ts": "1551531975", "text": "He got you on the last one, though. You wouldn't be asking how to say that if you weren't looking."},
{"mentions": [], "author": "Anonymous", "id": "1550038", "ts": "1551534521", "text": "Would it be easy / reasonable to try to hire a driver for a day or something? I like to move around but I dont have a driver licence and cant drive because of my condition. That so often makes me miss good places and is a general annoyance for me, so I was thinking if it would be reasonable to try to hire somebody to take to here and there. Taxis are a thing of course but they can be real annoying abroad"},
{"mentions": ["1549926", "1549939", "1549941"], "author": "Anonymous", "id": "1550408", "ts": "1551587413", "text": "Laos too, but seems to be the case in Vietnam as well.I guess your lady was a professional? Are there many love hotels in Hanoi?Thats messed up.After some research online it seems that there are hotels OK with it but most of them are not, and the only way to check it seems to be to ask their quest policy beforehand."},
{"mentions": ["1549479"], "author": "Anonymous", "id": "1550442", "ts": "1551593885", "text": "It's weird, Vietnamese girls complain that Vietnamese guys are too controlling, yah, but then when they start dating a white guy they're controlling as fuck themselves.SE Asian girls man. Not even once"},
{"mentions": ["1548350"], "author": "Anonymous", "id": "1550458", "ts": "1551598820", "text": "I dont understand where all these scams and rude people are, are you black or something?"},
{"mentions": ["1549109"], "author": "Anonymous", "id": "1550465", "ts": "1551601556", "text": "Mine belongs to me. I have it parked and I pick it up later. There are a bunch of guesthouses that do not mind storing your bike at $15 a month. Also means that you will come back to stay. It's a $300 investment. If you like the bike, you might as well keep it."},
{"mentions": ["1550408"], "author": "Anonymous", "id": "1550467", "ts": "1551602186", "text": "She wasn’t professional as far as I knew. Just had a university ID from when she studied in Thailand. This was in HCMC which had plenty. Not sure about Hanoi."},
{"mentions": ["1549472", "1549930"], "author": "Anonymous", "id": "1550488", "ts": "1551606203", "text": "Nah. There are already Korean guys and Japs and I’m sure even a few chinks slip through the ropes sometimes, even tho the Viets hate China, who are coming to Nam and are willing to wine and dine the girls, and spend a pretty penny on them, unlike whites. White guys are increasingly seen as loser backpackers that are just in the country for sex tourism or teaching English and making a pittance. You can thank the scrubby penny-pinching, unwashed Europoor backpackers reeking of cheesy feet and ass, dressed in rags that are so ubiquitous now in Saigon and Hanoi, and the South Africans for that one.Matter of fact, if Vietnam’s economy continues on its current upward trajectory, then the average Viet guy’s salary will soon match or surpass the white English teacher’s, and white guys will be public enemy numero uno like they are in the rest of Asia now. And before guys say “no that’s not true, they don’t want Vietnamese guys, they told me I’m handsome and have a bigger cock!” ...You don’t know Asian girls, kek. To them, money > cock size and looks, generally.Post a pic of your gf so I can laugh at how ugly she is then"},
{"mentions": [], "author": "Anonymous", "id": "1550570", "ts": "1551619040", "text": "Just got back from beer corner in Hanoi. Total rip off. Had to fight off overly aggressive touts with their menus telling me how cheap the beer was which it was not. Only foreigners there drinking Tiger and Tuborg. Got out of there back to my hotel with some beers I bought earlier at the super market for a fraction of the price as over there. Went up to the roof and watched the action below. Should have just done that to start with."},
{"mentions": ["1550488"], "author": "Anonymous", "id": "1550571", "ts": "1551619195", "text": "This. Vietnam will soon be like everywhere else. It is only going to get more expensive to live here. You already see it in the prices compared to that even a year ago. It is like Korea was in the 90s. The energy though is amazing. 50 percent are 20 to 30 and making something of themselves and their country. Really worth seeing it before it goes..."},
{"mentions": ["1550570"], "author": "Anonymous", "id": "1550647", "ts": "1551627901", "text": "that spots a rip off but there are bars outside the old town where a no name beer is 25c at happy hour"},
{"mentions": ["1550488"], "author": "Anonymous", "id": "1550657", "ts": "1551628961", "text": ">Matter of fact, if Vietnam’s economy continues on its current upward trajectory, then the average Viet guy’s salary will soon match or surpass the white English teacher’s,Because this is how economics works. When wages and prices rise, one job remains completely unaffected.And wasn't English etachers' pay a pittance a minute ago, and now it's \"soon to be matched\"?You sound like an asian dentist from California, or something. It would explain why you see nouveau riches Chinese as suave and sophisticated."},
{"mentions": [], "author": "Anonymous", "id": "1550744", "ts": "1551638427", "text": "/loser general/"},
{"mentions": [], "author": "Anonymous", "id": "1550868", "ts": "1551651003", "text": "Everything I've read about Vietnam says I'll constantly be on edge, worried about being pickpocketed or having my phone snatched. Food poisoning is a huge risk from cooks using drain water and that everyone will try to overcharge me and laugh at me as they're doing it. Plus there really isn't all that much to see.I've got 2 weeks off from work. Should I go to Vietnam or elsewhere?"},
{"mentions": ["1550868"], "author": "Anonymous", "id": "1550877", "ts": "1551651485", "text": "I am wondering all the same things.But one additional: I am sensitive to hot weather so when is the coolest time of the year to visit he had nom and what is the relatively coolest place in the country?"},
{"mentions": ["1550868"], "author": "Anonymous", "id": "1550897", "ts": "1551652959", "text": "go to wyoming"},
{"mentions": ["1550897"], "author": "Anonymous", "id": "1550909", "ts": "1551653713", "text": "What is there to see in Wyoming?"},
{"mentions": ["1550868"], "author": "Anonymous", "id": "1550926", "ts": "1551654702", "text": "Everything you mention is true for the most part. Just go to Thailand if you want to go to SEA and not have to worry. Literally the moment you leave the airport in Vietnam you’re probably going to get scammed if you don’t have your wits about you... plus you’re a newbie."},
{"mentions": ["1550868"], "author": "Anonymous", "id": "1550935", "ts": "1551655307", "text": "My wife was paranoid as fuck from stories like this. Just roll with shit, bargain hard, and don't be an idiot. You will be fine."},
{"mentions": ["1549109"], "author": "Anonymous", "id": "1551018", "ts": "1551660168", "text": "I rented mine from style motorbikes in hanoi for 30 days. I rode it all the way down to saigon, and returned it no problems. They even conveniently have a location in hoain (halfway point), so they will do a free checkup on it. Only buy a bike if you want to run the risk of it turning out to be a piece of shit."},
{"mentions": ["1550488"], "author": "Anonymous", "id": "1551041", "ts": "1551661285", "text": ">the average Viet guy's salary will soon match or surpass the white English teacher's>actually believing thisVietnam's economy is growing, but most of the wealth is going to government cocksuckers and people who already had their foot in the door when the reforms happened. The average Viet is still doing well to get 12m vnd per month outside of HCM, and that's not going to change anytime soon"},
{"mentions": ["1551041"], "author": "Anonymous", "id": "1551163", "ts": "1551674587", "text": "It million is good in hcm city also. I see plenty of jobs for engineers advertised for 10 million here."},
{"mentions": [], "author": "Anonymous", "id": "1551204", "ts": "1551684689", "text": "Hanoi or Saigon for four days?"},
{"mentions": ["1549397"], "author": "Anonymous", "id": "1551214", "ts": "1551686548", "text": "Didn't mean to brag, but I don't want to earn less than before. Thank you for the URL!"},
{"mentions": [], "author": "Anonymous", "id": "1551282", "ts": "1551695135", "text": "Cool shit you guys found to do in HCMC?I don't really take photos for Instagram so that's not a priority"},
{"mentions": ["1551282"], "author": "Anonymous", "id": "1551354", "ts": "1551706045", "text": "Cool places to eat, mostly deserted hammock bars on the river. Shopping centres are pretty cool i never grew up with them so gigamall and landmark 81 are so cool to me, so many places to eat."},
{"mentions": [], "author": "Anonymous", "id": "1552534", "ts": "1551852454", "text": "Anyone got that stylised pic of the showdown between a grab bike and goviet driverI saw it in one of these threads but only understood how funny it is now that I'm here"},
{"mentions": ["1550488"], "author": "Anonymous", "id": "1552561", "ts": "1551859708", "text": ">my girlI don't like Asian girls, I only date other expats, but you're still full of it. I even get hit on my pretty decent looking locals here, a far cry from the west.You see ugly dumpy white guys with receding hairlines and faded, ill-fitting clothes with ugly Asian girls, sure.I'm pretty sure you're a butthurt Asian American or something because you're completely full of shit"},
{"mentions": ["1552561"], "author": "Anonymous", "id": "1553099", "ts": "1551931288", "text": "Me but also fat. Life is good"},
{"mentions": ["1541462"], "author": "Anonymous", "id": "1553306", "ts": "1551958677", "text": "isnt it super warm in that suit?"},
{"mentions": [], "author": "Anonymous", "id": "1553607", "ts": "1552008056", "text": "Is the long journey out to Sapa worth it if I am trying to do Hanoi and Halong bay and Sapa in 6 days? Is Sapa worth it?Am I wrong for skipping ho chi minh city I have read its real built up and cityish. Skipping for Cambodia because of time crunch.Anyone been to Latern festival in Hoi An?"},
{"mentions": ["1553607"], "author": "Anonymous", "id": "1554100", "ts": "1552088382", "text": "It'd be great if you had a bit more time. Sapa is best reached by overnight train and bus, but that takes quite a bit of time. 2 days in Sapa are enouh though, just to watch the sunrise and sunset over the rice hills, it's beautiful.HCMC doesn't have a lot to see, fine to skip. Hoi An is beautiful on pictures but quite touristy, lots of people trying to sell you boat tours on the lantern river, lanterns themselves, etc.6 days for 3 places is quite short desu."},
{"mentions": ["1550877"], "author": "Anonymous", "id": "1555617", "ts": "1552277155", "text": "Go to vegas"},
{"mentions": ["1550038"], "author": "Anonymous", "id": "1555981", "ts": "1552325374", "text": ">Would it be easy / reasonable to try to hire a driver for a day or something?Yeah we hired several drivers. 16 seater vans are everywhere - more than enough for our crew of 8 friends traveling through the country. We went from Hoi An to Phong Nha (8 hour drive ish) for about $150. He also showed us great places to eat and sightseeings on the way. We also did take night bus and other personal drives - there's a lot of options in Vietnam. They drive ugly as FUCK though - had around 5-6 near accident experiences. They do actually have semi-full control though, and some of them actually listens to you when you ask if they could take it slow"},
{"mentions": ["1550868"], "author": "Anonymous", "id": "1555985", "ts": "1552325695", "text": ">Everything I've read about Vietnam says I'll constantly be on edge, worried about being pickpocketed or having my phone snatched. Food poisoning is a huge risk from cooks using drain water and that everyone will try to overcharge me and laugh at me as they're doing it. Plus there really isn't all that much to see.We had 0 problems except from the lunatic driving and honking - which we adapted to. Really - I generally felt as safe in the countryside and cities in Vietnam as I did in most countries in Europe and the States. When going diving, or jungle and cave trekking in Phong Nha (best thing I've done in my life) they generally do have a very relaxed attitude towards security though. In Scandinavia, where I'm from, they'd NEVER allow anything close to the shit they did down there. First time divers had a quick theory rundown before they where basically pushed out in the open ocean with high waves. I was only snorkling but had a couple of near death experiences there - I was so glad I didn't go diving"},
{"mentions": [], "author": "Anonymous", "id": "1556403", "ts": "1552379577", "text": "I've realized I might've just fucked myself in terms of timing.I'm gonna arrive late (1030 pm) 5/22 to Hanoi. My current plan is>stay in Hanoi till 5/27, take bus in morning to Halong Bay>stay till 5/29, then head to Ninh Binh and leave 5/30>Stay in Sapa till 6/1, then take flight to Da Nang>immediately from Da Nang go to Hoi An>stay in Hoi an till 6/4 then leave to Da Nang for noon flightIs this too many places for the time I have? What should I rearrange/cut out? Sorry for the clusterfuck"},
{"mentions": [], "author": "Anonymous", "id": "1556774", "ts": "1552429900", "text": "What is the best place to visit in Vietnam if I just want to relax on the beach (maybe near nature?) and go to bars/clubs to get drunk and try to fuck locals or expats/tourists?Does such a place exist in Vietnam or should I go to Thailand for that?"},
{"mentions": ["1556774"], "author": "Anonymous", "id": "1556895", "ts": "1552442195", "text": "Vung Tau"},
{"mentions": ["1551018"], "author": "Anonymous", "id": "1557517", "ts": "1552534214", "text": ">hoainYou mean Hoi An."},
{"mentions": ["1550877"], "author": "Anonymous", "id": "1557518", "ts": "1552534252", "text": ">what is the relatively coolest place in the country?Sapa is pleasantly cool most of the year."},
{"mentions": ["1549469"], "author": "Anonymous", "id": "1557658", "ts": "1552559900", "text": ">It takes a year's work to have sex in Vietnam, I know this from my long personal history of waiting with my dick in my hand lol>Even if you can reach those grapes, they're probably just sour lol"},
{"mentions": ["1550003"], "author": "Anonymous", "id": "1557682", "ts": "1552563616", "text": "There's something about \"how do you say _____\" that Vietnamese people have trouble understanding. Even my co workers who speak good English don't really get what I'm asking when I ask how to say something.Woman is Phu Nu. Pronounced Foo Noo. Can't remember the tones."},
{"mentions": ["1557682"], "author": "Anonymous", "id": "1557766", "ts": "1552574866", "text": "Phu nu is kind of a fornal term, gai is girl. You call the girl you like \"gai dep\" not \"phu nu dep\""},
{"mentions": [], "author": "Anonymous", "id": "1557852", "ts": "1552584118", "text": "Do you guys seriously have trouble getting laid in Vietnam? I've had so much sex that I'm actively avoiding it now. It's been less than a week and I've been with 4 girls, 2 multiple times. Each one only took one 10 minute date. Then again, I fucked over 100 girls back home in the States, so I know the game. And no, Im not a hyper chad. I am average height with a dad bod, thinning hair, and a crooked nose"},
{"mentions": ["1556774", "1556774"], "author": "Anonymous", "id": "1557854", "ts": "1552584180", "text": "Phu Quoc, Da Nang"},
{"mentions": ["1557852"], "author": "Anonymous", "id": "1557885", "ts": "1552588623", "text": ">dad bod, thinning hair, and a crooked noseRepresent"},
{"mentions": ["1557852"], "author": "Anonymous", "id": "1557918", "ts": "1552591357", "text": "What’s the game?"},
{"mentions": ["1557918"], "author": "Anonymous", "id": "1557930", "ts": "1552592629", "text": "Lie on the internet about fucking hookers"},
{"mentions": ["1557852"], "author": "Anonymous", "id": "1557943", "ts": "1552593772", "text": "where do you fuck girls anyway? Are you the guy who bangs in the hostel dorm?"},
{"mentions": ["1549475"], "author": "Anonymous", "id": "1558110", "ts": "1552611365", "text": "yes just don't go to bars every night, especially ones with expat prices"},
{"mentions": [], "author": "Anonymous", "id": "1558124", "ts": "1552612211", "text": "this place sounds like a total shithole, why would anyone want to go there"},
{"mentions": [], "author": "Anonymous", "id": "1558152", "ts": "1552616976", "text": "If I wanna get laid, should I stay in a hostel, hotel, or Airbnb? Also not hooker, but just by meeting someone"},
{"mentions": ["1549002"], "author": "Anonymous", "id": "1558171", "ts": "1552621030", "text": " It's not that scary does cooking kill the rabies disease?"},
{"mentions": ["1557943"], "author": "Anonymous", "id": "1558597", "ts": "1552692818", "text": "Please be That Guy, I literally salute him."},
{"mentions": ["1541376"], "author": "Anonymous", "id": "1558674", "ts": "1552704986", "text": ">food was all right I guessDumb ass, the food is the best part"},
{"mentions": ["1558171"], "author": "Anonymous", "id": "1558734", "ts": "1552720813", "text": "I've got a business trip coming up in Vietnam and 2 free days. Is traveling to Ha Long Bay easy to do just by taking trains, or is it better to take a tour? And are there any other easy nature/scenery-oriented day trips from Hanoi?Cooking doesn't kill rabies. You need to burn it until nothing but carbon remains, and even then you can't be absolutely sure that you killed every little bit of it."},
{"mentions": [], "author": "Anonymous", "id": "1558769", "ts": "1552732079", "text": "Da Nang used to be comfy until the gooks ruined it."},
{"mentions": ["1558152"], "author": "Anonymous", "id": "1558794", "ts": "1552735468", "text": "Apparently there's a law against foreigners having sex with locals, so I'd avoid anywhere with a front desk"},
{"mentions": ["1558734"], "author": "Anonymous", "id": "1558845", "ts": "1552746565", "text": "OK Scoob, now I am scared."},
{"mentions": ["1558769"], "author": "Anonymous", "id": "1558850", "ts": "1552747373", "text": ">Da Nang used to be comfy until the gooks ruined it.what do you mean, what happened?"},
{"mentions": ["1550003"], "author": "Anonymous", "id": "1558878", "ts": "1552752631", "text": "girl is \"cô gái\" \"phụ nư\" means woman not girl"},
{"mentions": ["1558794"], "author": "Anonymous", "id": "1558968", "ts": "1552766927", "text": "The fuck? That's really a law?"},
{"mentions": ["1558794"], "author": "Anonymous", "id": "1558975", "ts": "1552768207", "text": "You retards need to stop spreading this shit. Go to any by-the-hour hotel and fuck as many Vietnamese girls as you want."},
{"mentions": ["1558968"], "author": "Anonymous", "id": "1559191", "ts": "1552803689", "text": "Vietnam isnt north korea bro."},
{"mentions": ["1541220"], "author": "Anonymous", "id": "1559208", "ts": "1552808139", "text": "https://www.youtube.com/watch?v=JqUiVUld33I"},
{"mentions": ["1558794"], "author": "Anonymous", "id": "1559211", "ts": "1552808506", "text": "You're thinking of Laos."},
{"mentions": ["1558850"], "author": "Anonymous", "id": "1559253", "ts": "1552815033", "text": "Korean tourists are everywhere in the city now"},
{"mentions": ["1559253"], "author": "Anonymous", "id": "1559255", "ts": "1552815406", "text": "Na trang chineseDa nang korean"},
{"mentions": ["1558850"], "author": "Anonymous", "id": "1559260", "ts": "1552816536", "text": "Da Nang was amazing like +5 years ago.Now it's flooded with Korean's on tours and \"digital nomad\" type Westeners bidding everything up, plus all the coastline down to Hoi An has been swallowed up by Chinese development. It's a tragedy."},
{"mentions": ["1559260", "1559253"], "author": "Anonymous", "id": "1559477", "ts": "1552845608", "text": "Sounds like shit.Any other cities I should look up for a job teaching Engrish?Seems like Saigon is the only option at this point."},
{"mentions": ["1559477"], "author": "Anonymous", "id": "1559487", "ts": "1552846502", "text": "Vietnam is oversubscribed. China is your best bet for money."},
{"mentions": ["1559487"], "author": "Anonymous", "id": "1559728", "ts": "1552868466", "text": ">China is your best bet for moneyThe pay is good these days because the crackdowns on illegal teachers have taken their toll, there aren't many illegals left and a lot of schools have been forced to go legit which drove up demand.You can't get the high prices from the online agencies though, they're not passing on the higher salaries, it's only if you get a job directly or by referral somehow.You need a degree and to be a native speaker though."},
{"mentions": ["1559728"], "author": "Anonymous", "id": "1559815", "ts": "1552871783", "text": ">You need a degree and to be a native speaker though.What if I have a degree (legit degree) + CELTA but I'm not a native speaker? (I'm white and my accent is decent enough)."},
{"mentions": ["1559815"], "author": "Anonymous", "id": "1560170", "ts": "1552922826", "text": "Lie"},
{"mentions": ["1560170"], "author": "Anonymous", "id": "1560357", "ts": "1552947035", "text": "Really, just like that?lol"},
{"mentions": ["1560357"], "author": "Anonymous", "id": "1560556", "ts": "1552971362", "text": "That's what I'd do"},
{"mentions": ["1560556"], "author": "Anonymous", "id": "1560858", "ts": "1553029233", "text": "I'll try."},
{"mentions": ["1559815"], "author": "Anonymous", "id": "1562036", "ts": "1553220516", "text": ">What if I have a degree (legit degree) + CELTA but I'm not a native speaker? (I'm white and my accent is decent enough).If you have a few years work experience then you can still get the visa, the degree might need to be from an English speaking country, not sure.Lying will only get you illegal jobs obviously because you won't have the paperwork. I mean, it's not like you can say \"oh, I'm from London\" and then give them a Russian passport and get a teaching visa.There are still illegal jobs around but they're trending downwards and they've become a lot harder to find and even harder to keep in the tier 1 cities. Out in the sticks it can still work though.Beijing has really purged the illegal schools, Shenzhen and Shanghai have crackdowns semi-regularly but maybe the turnover and general mass of illegal teachers means it will take a while.The only school I know that makes a big habit of employing illegal teachers is associated with a university and employs teachers on student visas, I guess that's safe enough. The ones that do tourist and business visas are amateurs at it and will probably get purged some time because they don't have an officially approved rort or friends in immigration who can ok their fraud."},
{"mentions": ["1541220"], "author": "Anonymous", "id": "1563039", "ts": "1553409079", "text": "Hey guys, which website do y’all use for your invitation letter for the tourist visa? (US passport)"},
{"mentions": ["1563039"], "author": "JD", "id": "1563064", "ts": "1553412001", "text": "https://evisa.xuatnhapcanh.gov.vn/trang-chu-ttdt"},
{"mentions": ["1563039", "1563064"], "author": "Anonymous", "id": "1563138", "ts": "1553427102", "text": "Samefag"},
{"mentions": ["1563138"], "author": "Anonymous", "id": "1563141", "ts": "1553428175", "text": "Which one do you use?"},
{"mentions": [], "author": "Anonymous", "id": "1563145", "ts": "1553429844", "text": "Is it easier to get laid in Hanoi or HCMC?"},
{"mentions": ["1563145"], "author": "Anonymous", "id": "1563150", "ts": "1553430362", "text": "I had much better luck in Hanoi. Nightlife is concentrated in the Old Quarter. It's fun.With other foreigners though, usually Europeans or Brits. Best I got off a local girl was a handy. The Vietnamese girls are weirdly conservative and honestly not worth the effort. Most won't fuck you unless you're living and working in Vietnam."},
{"mentions": ["1563141"], "author": "Anonymous", "id": "1563154", "ts": "1553431896", "text": "Through the embassy?"},
{"mentions": ["1563145"], "author": "Anonymous", "id": "1563305", "ts": "1553457166", "text": "If you mean Vietnamese girls, it’s HCMC. Gotta look a little bit chad and hang out with them for a few days though."},
{"mentions": ["1563150"], "author": "Anonymous", "id": "1563726", "ts": "1553511331", "text": ">The Vietnamese girls are weirdly conservativeCountry girls especially, city girls a little easier but not by a lot.And yeah, they prefer to date rather than one night stand. Being seen as a slut is a big thing to them.Most girls will put out after a few dates and when it's clear that it's leading into a long term relationship but not all, some will want to wait till you marry them. Nearly all of them would like to know that the relationship is heading towards marriage before they start fucking as though they're already married."},
{"mentions": ["1563726"], "author": "Anonymous", "id": "1563729", "ts": "1553511674", "text": "do they keep fucking after they marry?i kind of like the conservative aspect.i prefer flirting over fucking."},
{"mentions": ["1541220"], "author": "Anonymous", "id": "1563889", "ts": "1553538623", "text": ">Hoi Ancan anyone speak for/recommend the tailors there? i really want to go there and get 5 bespoke suits for a quarter of the price of one in the US but i dont like doing things without the recommendations of online strangers. also i generally dont trust any of the online reviews because most, if not all, of them are \"sponsored\" by a certain tailor."},
{"mentions": [], "author": "Anonymous", "id": "1564070", "ts": "1553563368", "text": "5 days in Hanoi (pretty much 4 and a half cause my flight leaves around noon on the fifth day.Should I stay there the whole time or go to Ninh Binh for a day or two?"},
{"mentions": [], "author": "Anonymous", "id": "1564256", "ts": "1553582839", "text": "OK guys. I work in Ho Chi Minh City. My friend is coming here for two weeks. I have two weekends with her to get out of the city. One is a 5 day weekend thanks to Labor Day. What weekend trips should we do? We need plans for one 2 night and one 4-5 night trip.For the long weekend, I'm thinking that we go to Hanoi for 2 nights and Sa Pa for 3. But I'm open to suggestions. What did you do in Sa Pa? Did you go on a guided tour? What about Ninh Binh or Cao Bang or other places in the north?I speak enough Vietnamese to get by. Motorcycles are not an option."},
{"mentions": ["1564256"], "author": "Anonymous", "id": "1564259", "ts": "1553583028", "text": "Eat some sandwiches, go to an amusement park in the mountains and play with some Russian qts."},
{"mentions": ["1564070", "1563726", "1558734"], "author": "Anonymous", "id": "1564260", "ts": "1553583198", "text": "Go to Ninh Binh. I'm not the biggest Hanoi fan. After visiting the museums and hooking up with a backpacker in the Old Quarter it's best to move onto new sights.>And yeah, they prefer to date rather than one night stand. Being seen as a slut is a big thing to them.This. If you're in it for the long haul (or at the very least something steady) then they're fine with putting out. But the idea of being just a number is a major turn off for them.Rabies is from a virus, not from prions. You're thinking of Mad Cow."},
{"mentions": ["1563729"], "author": "Anonymous", "id": "1564289", "ts": "1553588986", "text": ">do they keep fucking after they marry?They START fucking after they marry. Sex with boyfriends is kind of like an advance since they're planning on marrying so it's close enough. And not all girls will do this."},
{"mentions": ["1563889", "1564259"], "author": "Anonymous", "id": "1564292", "ts": "1553589385", "text": ">can anyone speak for/recommend the tailors there?Yeah, I can, I've done that a few times.Allow a decent length of time, you'll have multiple fittings, they'll fuck shit up, you won't get it properly stitched on the first go...stuff like that. Maybe allow a full week if you're not in a hurry.Do NOT go to a tailor in the centre of town that gets lots of people in, look for one on the outskirts who has cheaper rent and is more desperate for customers. Consider not getting everything up front, maybe order a few shirts from different places and see which does the best job before ordering suits.Any custom stuff is fine, they'll just pull out a laptop and google for what you want, then start sketching a pattern. You'll mostly be limited to the fabrics they have on display in the shop but I got put on a bike and driven to a fabric warehouse to choose something once.Get some outrageous clothes man, I had a dark purple suit with lining of Chinese satin with dragons, it was amazing. Mandarin collar and matching shirts so that I could wear it in the office and have a good excuse for not wearing a tie.The tailor I liked was on the highway out to the beach resorts, last tailor on the right, just before a field but still just inside the town.You can also get custom shoes made there, it's a bit hit and miss, the ones I had made were a touch too small and never comfortable, though they looked great for formal occasions.>Russian qtsThere are Russian qts in Nhatrang too but they're mostly with boyfriends. There's an airport with direct flights from Moscow so it's full of Russians."},
{"mentions": ["1564256"], "author": "Anonymous", "id": "1564337", "ts": "1553598202", "text": "Wtf is this 5 day weekend, no one informed me of this"},
{"mentions": ["1564292"], "author": "Anonymous", "id": "1564344", "ts": "1553600281", "text": "Are Vietnamese girls open to dating Russians?"},
{"mentions": ["1564337"], "author": "Anonymous", "id": "1564459", "ts": "1553616116", "text": "At least according to my dispatch company, public schools have off from April 29th until May 1st."},
{"mentions": ["1564344"], "author": "Anonymous", "id": "1564472", "ts": "1553617516", "text": ">Are Vietnamese girls open to dating Russians?Why wouldn't they be?You'd want to speak Vietnamese though because not many young women speak Russian. Only people about 40-60 are going to have gone to university in Russia."},
{"mentions": [], "author": "Anonymous", "id": "1564548", "ts": "1553630589", "text": "Do scooter/motorcycle rentals also provide helmets? Decent helmets?"},
{"mentions": ["1564472"], "author": "Anonymous", "id": "1564720", "ts": "1553647996", "text": "I don't expect them to speak Russian anyway, but I heard that Vietnamese youth is now super pro-American, and if they want to date non-Asian, they'd prefer Americans. The dating culture seems to be quite similar to that in Russia, where in most cases you have to be in a more or less long-term relationship to have sex."},
{"mentions": ["1564548"], "author": "Anonymous", "id": "1564751", "ts": "1553651779", "text": "Yes but they are shit, the same ones you buy one the roadside for 100k"},
{"mentions": ["1564720"], "author": "Anonymous", "id": "1564807", "ts": "1553661744", "text": ">The dating culture seems to be quite similar to that in Russia, where in most cases you have to be in a more or less long-term relationship to have sexWow, that was not my impression of Russian girls but ok. Yes, that's about how it is in Vietnam.The foreign culture stuff goes like this:Generation 1: learnt French, used to hate French but probably over it now, they appreciate the cheese and wineGeneration 2: learnt Russian, maybe went to university in Russia (especially doctors, engineers etc), probably don't have really strong feelings about Russians but might enjoy reminiscing about university days with themGeneration 3: learnt English, probably admires foreigners for their wealth and success, a small minority are rich enough to go overseas for universityGeneration 1 is nearly dead at this pointGeneration 2 is middle-aged or nearing retirement age (well, not really in Vietnam)Generation 3 is youngish"},
{"mentions": ["1543594"], "author": "Anonymous", "id": "1564864", "ts": "1553668512", "text": "woosh"},
{"mentions": ["1564344"], "author": "Anonymous", "id": "1564873", "ts": "1553670041", "text": "No, they think you’re poor scrubs. Don’t try to teach English illegally here either Igor, you fucking loser"},
{"mentions": ["1564344"], "author": "Anonymous", "id": "1564932", "ts": "1553682919", "text": "I'm not sure but I have the feeling russian men are the same as vietnamese men and most vietnamese girls date white men because they dont act like vietnamese men."},
{"mentions": ["1564807", "1564932", "1564873"], "author": "Anonymous", "id": "1565043", "ts": "1553699512", "text": "Seems like the dating culture in Vietnam indeed very much resemble Eastern Europe:https://www.rooshvforum.com/thread-72600-post-1951024.html> You see more AMWF couples in Eastern Europe because Asian men from Asian countries are traditional-minded, and therefore match up better with Eastern European women who are similar. It also helps that the women are pretty and slender. I have two Viet uncles there who are married to EE women, and they both said their wives are just like Viet women. >I'm in an AMWF marriage myself, and my wife (mixed European background including EE) is often regarded by Asians as being \"more Asian\" than themselves, because she's very traditional.That said, I don't behave like an average Russian at all (and yes, it brings me problems with dating here). The only place in SEA I can fly to straight from my city is Nha Trang in Vietnam (strangely, the airport has to flights to Thailand), and that place seems to have a lot of Russians (mostly low-class ones from Siberia) and Russian-speaking locals.Don't worry, I'm not going to make a competition for you. I have a sort of guaranteed basic income with is around the same as average Russian pension (not much at all, but enough to survive), and do some freelance work, but not enough to sustain a digital nomad lifestyle right now."},
{"mentions": ["1565043"], "author": "Anonymous", "id": "1565108", "ts": "1553705089", "text": ">rooshopinion ignored"},
{"mentions": ["1565108"], "author": "Anonymous", "id": "1565113", "ts": "1553706157", "text": "It doesn't contradict anything being said ITT so far, though."},
{"mentions": ["1565043"], "author": "Anonymous", "id": "1565693", "ts": "1553780369", "text": "Quy Nhon is almost untouched by tourists. Beautiful beach, quiet, quaint town. Beautiful beach walk with all the locals coming out. Underrated for sure, and a gem, if that's the kind of thing you're looking for. Charming and sweet and romantic.Da Nang in my opinion, is the pride of Vietnam, because of the last governor there that passed away a few years ago, and many locals think he was poisoned. He was outspoken and brash and openly critical of Vietnam's government. His speeches are a big hit on YouTube. He built all those beautiful bridges and hospitals and all of that. It is a sparking-ly clean, modern city, and it's near Hoi An and many many local hidden waterfalls and beaches and so on. Hoi An of course, is magical. Expats from all over the world have flocked here, and it's wonderful to have that diversity. And Vietnamese food in Vietnam in general, is not as good as Vietnamese food overseas, like in the US. Competition is good, it breeds innovation and improvement. Kaizen. I hate Saigon. Hopefully one day they'll have public transport like Japan and things will improve. Da Lat is great to go in the summer to escape the heat, because it's in the mountains so it's cool year-round. Breathtaking. Flowers and the lake and waterfalls and so on. Very family-friendly and clean and wholesome. Ha Long Bay. My favorite part was waking up early and going canoeing in the gorgeous fog among those ethereal rocks. Switch those adjectives. I was able to obtain marijuana in almost every locale. I do speak the language. I'd like to explore the North more. There was an army Sgt. or something who said the North Vietnamese were the best soldiers he'd ever fought. Ken Burn's The Vietnam War, it's on Netflix. My father was a police officer and fought with the Americans on the south. What a fucking shit-show. Made me proud and respect Ho Chi Minh a lot more, when I was taught to hate him. He knew how to win the people, wearing peasant clothes. 2000 char limit"},
{"mentions": ["1565043", "1565693"], "author": "Anonymous", "id": "1566125", "ts": "1553831492", "text": ">The only place in SEA I can fly to straight from my city is Nha Trang in Vietnam>that place seems to have a lot of Russians (mostly low-class ones from Siberia) and Russian-speaking localsIt's a former/current Soviet/Russian military airbase, now they've converted part of it as a civilian airport but only for Russian airlines.This is both why the locals still speak Russian a lot and why there are so many Russians.When I was there, I think most of the men were military, I saw lots of military tattoos on guys at the beach and guys who looked exactly like non-com officers on their day off. It's definitely not a city that I'd want to be in a bar fight in.I kind of hooked up with a Russian girl there and went around with her for a few days, she thought that most of the guys were probably corrupt low-level officers with trophy wives, spending embezzled money from their army departments. She was an accountant and believed that literally everybody who had control of money in Russia was corrupt (including her a little bit).>There was an army Sgt. or something who said the North Vietnamese were the best soldiers he'd ever foughtI've never heard anyone talk about Võ Nguyên Giáp without agreeing that he was a military genius. He fought against three foreign super powers in Vietnam over 50 years. Arguably an unmatched feat in human history."},
{"mentions": [], "author": "Anonymous", "id": "1566817", "ts": "1553954556", "text": "What’s everyone’s favorite district in HCMC?"},
{"mentions": ["1566817"], "author": "Anonymous", "id": "1566906", "ts": "1553970988", "text": "Lwhere ever the best ma tuy is"},
{"mentions": ["1566817"], "author": "Anonymous", "id": "1567390", "ts": "1554048437", "text": ">1 is like Bangkok minus the public transit. Has foreign food and tourist stuff and Bui Vien and all that good shit.>2/Bin Thanh are like if you vaguely described Battery Park to someone and had them recreate it.>3 is pretty cool. I used to live in a hem off Nguyen Dinh Chieu. Good area but tough to find good gyms. >4 has a good location and great food. Traffic can be bad though.>5 has plenty of cool things and excellent food but it can be quite crowded. Chinatown probably has some stuff they haven't burned down in a race riot yet.>6 is like d5 but with sketchy parts. Walking through district 6 is the only time I've had my sketchy alarm go off.>I live in a quiet Vietnamese neighborhood in D7. Great coffee. Phu My Hung is geared towards expats, namely the Korean ones. >Never been to d8, d9, or d11>D10 is cool and bus #30 gets you in surprisingly quickly down CMT8. Traffic can be tough.>Never been to d11 or d12.>Go Vap is far>I don't know why I wrote all thisDistrict 1 is obviously the best district because they have proper bangers and mash and Bui Vien m9"},
{"mentions": ["1567390"], "author": "Anonymous", "id": "1567454", "ts": "1554054038", "text": "What do you think of d9 and thu duc? I think thu duc uas the most comfy relaxed part of the river"},
{"mentions": ["1567390"], "author": "Anonymous", "id": "1567514", "ts": "1554060850", "text": "I appreciate you writing all of this very much. Thank you."},
{"mentions": ["1567454"], "author": "Anonymous", "id": "1567827", "ts": "1554098792", "text": "Thu Duc, D2, and Binh Thanh are all quite nice and relaxed. A great mix of western and local. I live in District 7 though so I rarely venture out there.Never really been to D9. I'm sure it's nice but it's probably a pain in the ass to get downtown."},
{"mentions": ["1567390"], "author": "Anonymous", "id": "1568403", "ts": "1554172199", "text": ">they have proper bangers and mashWould they be imported sausages or locally made?I guess any expat cook could probably mince some pork and make their own if they know how to spice it right."},
{"mentions": ["1568403"], "author": "Anonymous", "id": "1568476", "ts": "1554182571", "text": "Deadass I had no idea what bangers and mash actually were until I looked it up, I was being facetious. Fuck if I'm touching British \"food\" in Southeast Asia lolThat said I'm sure there are plenty of bars that make their own."},
{"mentions": ["1556403"], "author": "Anonymous", "id": "1569218", "ts": "1554280270", "text": "3 days in Hanoi is enough"},
{"mentions": [], "author": "Anonymous", "id": "1569953", "ts": "1554387692", "text": "In HCMC. My prospective employer pocketed my passport. What should I do?"},
{"mentions": ["1569953"], "author": "Anonymous", "id": "1570340", "ts": "1554439240", "text": "What was the stated reason, and how long are they holding it for?"},
{"mentions": [], "author": "Anonymous", "id": "1570364", "ts": "1554442878", "text": "How bad is the rainy season really? Like northern Vietnam, Hanoi, Ninh Binh, etc in early July"},
{"mentions": [], "author": "Anonymous", "id": "1570775", "ts": "1554503588", "text": "chink thread?"},
{"mentions": ["1570775"], "author": "Anonymous", "id": "1570792", "ts": "1554505586", "text": "Do you mean a nigger thread?"},
{"mentions": ["1569953"], "author": "Anonymous", "id": "1570795", "ts": "1554505694", "text": "Why did you even give it to them, English teacher?"},
{"mentions": ["1569953"], "author": "Anonymous", "id": "1570993", "ts": "1554527835", "text": "I thought everyone just say I forgot my passport, maybe tomorrow, for a year"},
{"mentions": [], "author": "Anonymous", "id": "1571134", "ts": "1554556031", "text": "How much does a bike cost, if I stay for 3 months should I buy a motorbike and then try and sell it at the end or rent one?"},
{"mentions": ["1570340", "1570795"], "author": "Anonymous", "id": "1571267", "ts": "1554575287", "text": "Photocopy."},
{"mentions": [], "author": "Anonymous", "id": "1571284", "ts": "1554577243", "text": "Where does one buy heroin in hcm?"},
{"mentions": ["1571267"], "author": "Anonymous", "id": "1572294", "ts": "1554721766", "text": "Go get it back then. It's a photocopy, it takes 2 seconds. Keep texting them saying you need it and if they're in the office go over and ask for it back."},
{"mentions": ["1571284"], "author": "Anonymous", "id": "1572295", "ts": "1554721857", "text": "Hoa Hung street off CMT 8. The further down the better the quality. Just be loud and confident and be sure to enunciate heroin and eventually someone will come and get you, even if they pretend like you're in the wrong place."},
{"mentions": [], "author": "Anonymous", "id": "1574206", "ts": "1554974152", "text": "Someone I know is getting married in Vietnam(not sure what city yet) but I'm debating as using this as an excuse to visit Vietnam and surrounding countries. Few questions, how easy and pricey is it to travel between Vietnam/Cambodia/Thailand? (essentially, what's the cheapest way with some comfort) ... and to have a nice 2-3 week trip between the area, what would be the estimated cost?(flying from NY) The AirBnB looks insanely cheap and I'm guessing decent food is too?"},
{"mentions": [], "author": "Anonymous", "id": "1574234", "ts": "1554979279", "text": "Why are Viet girls so flaky or boring/bad at making conversation? After you meet them on tinder and take things to whatsapp or the viet whatsapp, they stop replying or hardly reply. Also sick of wasting time on dates. How do you bypass this"},
{"mentions": ["1549021"], "author": "Anonymous", "id": "1574236", "ts": "1554980191", "text": "Rabies is a fucking terrifying disease."},
{"mentions": ["1574206"], "author": "Anonymous", "id": "1574293", "ts": "1554987580", "text": "50 euro flight with AirAsia/JetStar from Saigon to Bangkok. (one-way ticket, 90 min flight)Getting a flight to Cambodia is a little bit more expensive. 70 euro.If you want to save some money and want some adventure, try the bus to the border. Just be aware that there are some scams going on:https://www.lonelyplanet.com/vietnam/ho-chi-minh-city/practical-information/transport/getting-there-and-away/border-crossings/9e2fdaef-d807-4780-b971-a34b05973316/a/nar/9e2fdaef-d807-4780-b971-a34b05973316/357884Finding good food and finding a nice place to sleep is very easy, in all price ranges. How much you'll spend is more about how much luxury do you want to treat yourself too. Clubbing, fancy restaurants and organized day trips will hurt your wallet. (but it's be fun ofc) Eating like the locals will help to save some money. Do it man, you'll have loads of fun."},
{"mentions": [], "author": "Anonymous", "id": "1574616", "ts": "1555023042", "text": "Why would anyone go to this try-hard shitty China when you can just visit China?"},
{"mentions": ["1574234"], "author": "Anonymous", "id": "1574617", "ts": "1555023150", "text": ">Why are Asian girls so flaky or boring/bad at making conversation?ftfy. From Java to Hokkaido, to Yangon to Samar"},
{"mentions": ["1574234"], "author": "Anonymous", "id": "1574620", "ts": "1555023322", "text": ">every girl in this nation of 100 million is boring. Why can’t they be as interesting as me? >just looking to fuck btw don’t want to deal with having to be interesting enough to make them want to fuck meI’ve had zero trouble in Vietnam and I’m definitely not a head-turner in my home country. I’m borderline autistic yet conversation flows nicely even with a language barrier. Maybe it’s time to re-evaluate your problem, because it’s probably not the ladies who are the problem."},
{"mentions": ["1574616"], "author": "Anonymous", "id": "1574736", "ts": "1555039551", "text": "It’s actually a less autistic version of China."},
{"mentions": ["1574234"], "author": "Anonymous", "id": "1574762", "ts": "1555043903", "text": "Because most of Vietnamese's english skills are dog shit tier, that's why bongs and mutts uses to go here to teach English"},
{"mentions": ["1574620"], "author": "Anonymous", "id": "1574937", "ts": "1555066023", "text": "Agree, I even consider the language diference an advantage as the girls are already interested unless you fuck it up.The language difference limits the conversation you can have, and if you see the girl getting bored you just ask her a question (whats your job, what did you study, what do yo do on your free time, did you travel...) and just let her speak. Eventually you just get up, say lets go and go to your apartment. If she asks where are we going you just tell her to your apartment and if she is not comfortable you say her you need to charge your phone, show her the views, you want to leave a jacket or get more clothes...In the apartment just tell her to sit down, put her some music/tv so she relaxes, do your chores for 5 minutes, sit next to her and kiss her. Then go from there on."}
]