[
{"opener": "Vojáci dostanou nový systém živé simulace. Velký armádní nákup za více než tři sta milionů korun oznámil začátkem září ministr obrany Lubomír Metnar. Systém má dodat švédská společnost Saab, ministerstvo zakázku zadalo přímo, bez soutěže. Dokumenty, které nyní získala MF DNES, však vzbuzují o nákupu pochybnosti.", "text": "Systém živé simulace je podobný oblíbené hře Laser Tag. Hráči bojují s napodobeninami zbraní osazených laserem, který hlásí zásah soupeřova těla. Armádní systém je mnohem sofistikovanější: vojáci při simulaci střílí slepými náboji, laserové zářiče mohou připevnit i na kulomety a minomety.Česká armáda má takový systém už několik let. V roce 2009 jí ho dodala švédská společnost Saab. Ten však již nevyhovuje současným požadavkům Severoatlantické aliance.Ministerstvo mělo na výběr víceméně ze dvou variant. První bylo zadání zakázky znovu společnosti Saab. Druhou variantu nabízel státní podnik LOM Praha (respektive jeho dceřiná firma VR Group) spolu s německou firmou Rheinmetall. Vláda, která si podporu domácího zbrojního průmyslu vytyčila za jednu z priorit, však zakázku přidělila „z ruky“ Saabu.Vynechaný průzkumNe všichni na ministerstvu přidělení zakázky Saabu podporovali. Letos v dubnu náměstek ekonomické sekce ministerstva obrany Pavel Beran upozornil dalšího náměstka tehdejší ministryně Karly Šlechtové Daniela Koštovala na možné problémy.„Nenamítám nic proti potřebě armády a vojenské policie pořídit systém živé simulace, mám však zásadní připomínku k takto arbitrárnímu výběru dodavatele,“ uvedl v dopise, který má redakce k dispozici.Beran upozornil na marketingový průzkum z roku 2017, který měl za úkol zmapovat trh v oblasti živých simulací. „S výsledky průzkumu, které jste (myšleno Koštoval – pozn. red.) podepsal v srpnu 2017, jste byl seznámen nejen vy jakožto zadavatel, ale také náčelník generálního štábu jako uživatel pořizované techniky. V materiálu do kolegia (to nákup techniky schvaluje – pozn. red.) však chybí jakýkoli byť jen útržek informace, že systém dodávaný společností Saab není na trhu jediný,“ vyčítá Beran kolegovi.Na zmíněný marketingový průzkum se odvolává i ministerstvo obrany v reakci na kritiku nákupu. Tvrdí, že z jeho výsledků vyplývá, že nákup systému od Saabu bude výhodnější.„Je bez jakýchkoli rozporů, že by zadání veřejné zakázky takového rozsahu bez předchozí soutěže stávajícímu dodavateli zcela jistě vedlo k posílení jednostranné závislosti ministerstva obrany na dodávkách a službách společnosti Saab,“ píše Beran a dodává, že zakázku by mohl zrušit Úřad pro ochranu hospodářské soutěže. Požaduje proto vypsání tendru.„Zabraňme tomu otevřením tendru tržní soutěži, dokud je čas a náklady změny systému nejsou prohibitivně vysoké. Trvám na tom, že neexistuje pouze jediný možný dodavatel, a požaduji, aby mezi potenciálními dodavateli proběhla soutěž,“ uzavřel Beran.Podle bývalé ministryně obrany Karly Šlechtové šlo jen o neshodu mezi dvěma ministerskými náměstky, která se do podpisu tendru vyjasnila.„Nechala jsem prověřit nesoulad mezi dvěma náměstky, aby si vyjasnili postoje,“ řekla k tomu Šlechtová deníku Právo.Ministerstvo: Počítáme s vámiSpolečnost LOM Praha, která je dceřinou firmou ministerstva obrany, měla o kontrakt velký zájem. Už loni v lednu kvůli zakázce napsal ředitel LOM Roman Planička tehdejšímu ministrovi Martinu Stropnickému a náčelníku generálního štábu Josefu Bečvářovi dopis. Upozorňuje v něm na výhody systému Legatus firmy LOM a nabízí možnost otestovat ho odborníky ministerstva a armády na základně v německém Letzlingenu.V březnu loňského roku ministerstvo Planičkovi odpovědělo. „S pověřením ministra obrany vás informuji o tom, že v této souvislosti očekávám aktivní přístup všech potenciálních uchazečů,“ uvedl náměstek Tomáš Kuchta a dodal, že LOM bude mezi společnostmi, jež ministerstvo v souvislosti se zakázkou osloví. Nestalo se. Letos v červnu ministryně Šlechtová rozhodla o tom, že obrana zakázku nevypíše a přidělí ji Švédům.", "authors": "Autor: Karel Hrubeš", "disc_nr": 23, "discussion_url": "https://zpravy.idnes.cz/diskuse.aspx?iddiskuse=A180925_162423_domaci_ane&razeni=time", "images": []},
{"opener": "ANO by po volebním debaklu v Praze mělo zcela po zásluze skončit na magistrátu v opozici. Řekl to v neděli premiér vlády a lídr hnutí Andrej Babiš. Výsledek voleb je dle něj důsledkem negativního působení lidí z ANO na magistrátu.", "text": "Babiš se tak vyjádřil v České televizi v reakci na to, že hnutí, které v minulém období mělo primátorku Adrianu Krnáčovou, skončilo v hlavním městě na pátém místě a v zastupitelstvu bude mít 12 křesel. Podle Babiše se na výsledku voleb negativně podepsalo působení lidí za ANO na pražském magistrátu, případně jejich mediální prezentace, a práce starostů za ANO.FotogalerieZobrazit fotogalerii„Celkově největší vliv na výsledek mělo to, co předvedli zástupci ANO na magistrátu. Budeme požadovat, aby převzali za to odpovědnost,“ řekl mimo jiné Babiš a vyjádřil nesouhlas s dnešním tvrzením prezidenta Miloše Zemana, že handicapem ANO bylo nasazení Petra Stuchlíka jako lídra, kterého nikdo neznal.Babiš současně ocenil občanské demokraty, kteří v Praze vyhráli a v 65členném zastupitelstvu získali 14 mandátů. Podle něj ODS uspěla, protože má na rozdíl od ANO dobré starosty. „Dlouhodobě nejsem spokojen s pražskou organizací ANO,“ dodal předseda ANO.Spolu s ODS a ANO mají mandáty v zastupitelstvu v Praze Piráti, Praha Sobě a koalice TOP 09 a STAN.Piráti a Praha sobě se dohodliPiráti a Praha Sobě se hned v neděli dohodli, že budou usilovat o vytvoření koalice na pražském magistrátu spolu se STAN a TOP 09. Zástupci obou stran to novinářům řekli po skončení schůzky. V následujícím týdnu chtějí jednat o otázkách programu, až poté budou řešit personální otázky. Jak lídr Praha Sobě Jan Čižinský, tak jednička Pirátů Zdeněk Hřib nicméně uvedli, že by se chtěli stát primátorem. Piráti se následně sešli i s Jiřím Pospíšilem a dalšími zástupci TOP 09 a STAN.Ministr, nebo starosta?Petříček se může soustředit na post ministra, v boji o starostu pohořel„V podstatě jsme se dohodli na tom, že se chceme dohodnout,“ řekl Hřib a dodal, že navazujících jednání o koalici by se podle něj měli účastnit i zástupci koalice TOP 09 a STAN. V následujících dnech by se měly sejít expertní týmy stran nad společným programem. „Veškeré personální záležitosti se budou řešit až potom,“ dodal.Zvažovaná koalice je podle Hřiba pro Piráty v tuto chvíli jedinou možnou, další možnosti by strana zvažovala až v případě, že by současná jednání selhala. Zádrhel by nicméně mohl vzniknout na otázce, kdo bude primátor. „Primátor by měl připadnout té straně, která získala ve volbách nejvyšší výsledek,“ uvedl Hřib. Piráti se umístili druzí po ODS se ziskem 17,1 procenta a obsadili 13 mandátů v 65členném zastupitelstvu. Praha sobě získala 16,6 procenta a rovněž 13 mandátů, stejný počet křesel má i TOP 09 a STAN se ziskem16,3 procenta hlasů.Primátorem chtějí být všichniPrimátorské křeslo by rád obsadil i Čižinský. „My o ten post samozřejmě máme zájem, protože Pražané dali největší počet hlasů právě mně, čímž dali najevo, že chtějí, abych byl primátorem,“ uvedl. Podle Hřiba nicméně volební systém do komunálních voleb není nastaven tak, aby sloužil k přímému výběru primátora.Babiš vyhrál, ale ztratil pocit neporazitelnosti, reagují v cizině na volbyDalším problémem koaličních jednání by se mohla stát otázka pravidel povolební spolupráce, která si Piráti schválili. Jejich součástí je, že nebudou spolupracovat se stranou, která by v radě měla člena s více významnými politickými funkcemi. Čižinský je poslanec a ve volbách obhájil post starosty Prahy 7. Avizoval, že v případě účasti na vedení Prahy se poslaneckého mandátu vzdá, k rezignaci na funkci starosty se nicméně staví odmítavě.„Z výsledku voleb je známá nějaká vůle voličů. I to je nutné brát v potaz, protože pokud voliči jednu osobu vykřížkují, že ji chtějí za primátora, a současně dostane nadpoloviční většinu na starostu, tak prostě to nějaký signál je,“ uvedl. Zopakoval, že konkrétněji se o těchto otázkách budou bavit až po vyřešení programových otázek.Prahu sobě u vyjednávacího stolu s Piráty vystřídali zástupci TOP 09 a STAN. Dvojka jejich kandidátky Hana Marvanová před schůzkou uvedla, že strana je otevřena jednání se všemi stranami s výjimkou ANO. Stejně jako Piráti se dnes sešli i s ODS. Praha sobě naopak deklarovala, že si koalici s občanskými demokraty představit nedokáže (jak vítěze a poraženého v magistrátu dělí pouze dvě křesla a v opozici mohou skončit oba, píšeme zde).TOP 09 se STAN možná takéMarvanová nevyloučila, že TOP 09 se STAN budou rovněž usilovat o post primátora. „Každé uskupení může chtít primátora, náš kandidát na primátora je Jiří Pospíšil, takže my bude určitě toto vznášet. Všechna uskupení dostala plus minus stejnou podporu od voličů, takže je to věcí dohody,“ řekla.Právnička Hana Marvanová při představení společné pražské kandidátky TOP 09 a STAN (14. května 2018)Předseda TOP 09 Jiří Pospíšil po schůzce s Piráty uvedl, že dnes šlo pouze o prvotní setkání a zatím nemá mandát od zastupitelského klubu zavázat se ke konkrétní dohodě. Klub uskupení ustanoví až v pondělí a na ustanovující schůzi si koalice stanoví jasnou představu o dalším vyjednávání. Dodal, že už před volbami deklarovali, že budou jednat i s ODS. Zopakoval, že nyní je na pořadu dne jednání o programu a personální otázky přijdou na řadu později.Po schůzce s ODS dnes Pospíšil uvedl, že s občanskými demokraty mají výraznou programovou shodu. Vyzval v dopise primátorku Adrianu Krnáčovou, aby do ustanovení nové rady dosluhující vedení města nečinilo žádné zásadní kroky.Rozdělení křesel na pražském magistrátu po komunálních volbách 2018", "authors": "Autoři: ČTK, iDNES.cz", "disc_nr": 565, "discussion_url": "https://zpravy.idnes.cz/diskuse.aspx?iddiskuse=A181007_200715_domaci_remy&razeni=time", "images": []}
][
{"opener": "Druhé největší město jižní Moravy povedou následující čtyři roky zástupci z ČSSD, ANO a ODS. „Nejde nám o trafiky a funkce, proto jsme se již během neděle dohodli na vzniku koalice pro obchvat. Vznikající koalice bude mít v zastupitelstvu města stabilní většinu tolik potřebnou pro prosazování všech důležitých projektů.", "text": "Jsou v ní tedy zastoupeny hlavní vládní strany a nejsilnější opoziční strana na národní úrovni. Věřím, že tato spolupráce přinese synergii potřebnou nejen pro dokončení stavby obchvatu, ale i pro realizaci nových věcí, které zlepší život všem Znojmákům,“ komentoval dohodu lídr ČSSD a současný starosta Jan Grois.KOMENTÁŘ: Vítězství bylo několik, ale povětšinou s hořkou příchutíSociální demokraté mají ve Znojmě nejlepší výsledek mezi okresy Jihomoravského kraje. Přestože tady triumf ČSSD není tak drtivý jako před čtyřmi lety, kdy získala 31,3 procent hlasů, nyní „jen“ 24,55 procent a ztratila tím dva mandáty. Je přitom patrné, že sociálním demokratům ve Znojmě nyní házeli hlas hlavně lidé v příměstských částech, starosta Grois se totiž o ně začal zajímat víc, než jeho předchůdci. Například v Derflicích mají přes 61 procent, v Načeraticích 47,6. Přímo v centru Znojma prvenství sociální demokracii ukradlo pětkrát ANO a čtyřikrát Pro Znojmo, jinak ve všech 39 obvodech vyhrála.Důležitým hráčem ve vyjednávání koalice bylo výrazně posílené ANO se sedmi mandáty. Po Brně je nejúspěšnějším okresním městem. Už během vyjednávání místostarosta a lídr ANO Jan Blaha naznačil, že cílem strany je podílet se na vedení města.ANO přitom mohlo vítěznou ČSSD „odstavit“, pokud by se spojilo s Pro Znojmo, které ale disponuje jen pěti mandáty, a tak by musely přibrat ODS, KDU-ČSL nebo Piráty.Dosud ve Znojmě téměř celé volební období fungovala trojkoalice ČSSD, ANO a KSČM. Nyní komunisty nahradili občanští demokraté. Lidé ve Znojmě dali „za uši“ tradičním stranám. Propadli se komunisté i KDU- ČSL. A jak si vedli nováčci? Nad pět procent se dostali Piráti a SPD. Znojmáci a Nestraníci propadli. Zvedla se i tragická volební účast ve Znojmě. V minulých komunálních volbách byla ve Znojmě nejhorší mezi okresními městy kraje - volila tu jen třetina lidí. Tentokrát přišlo k volbám 41,82 procent voličů", "authors": "Autor: Markéta Dušková", "disc_nr": 4, "discussion_url": "https://zpravy.idnes.cz/diskuse.aspx?iddiskuse=A181007_202953_volby_remy&razeni=time", "images": []},
{"opener": "ČSSD ve srovnání s minulými komunálními volbami ztratila přibližně polovinu mandátů. V Praze nebudou sociální demokraté v zastupitelstvu poprvé od roku 1990. „Nevidím to jako fatální prohru. To rozhodně ne,“ reagoval na výsledek první místopředseda sociálních demokratů Jiří Zimola.", "text": "Komunální volby pro ČSSD příliš dobře nedopadly. Za dva týdny se sejde výkonný výbor strany. Může se tam řešit otázka změny vedení? Ano, ve stanovách máme, že ústřední výkonný výbor může vyjádřit svým hlasováním vedení strany nedůvěru. Ať už předsedovi, místopředsedovi, statutárnímu nebo řadovému. Jsme koneckonců demokratická strana a já očekávám na ústředním výkonném výboru možná bouřlivou debatu. Ale byl bych rád, aby to byla debata korektní a vedená uvnitř strany. Nejsem z výsledku rád, ale politický život je takový, že jednou jste dole a jednou nahoře. My bychom měli udělat maximum proto, abychom se z toho dole co nejdříve zase dostali nahoru. Není to úplně na sebevraždu, ale taky není žádný důvod k jásotu. Musíme si sednout, uspořádat si vnitřní záležitosti a zlepšit prezentaci.  Volby 2018Zobrazit fotogaleriiVy rezignovat nehodláte?Odvolávám se na slova Jana Hamáčka, které plně podporuji. Současné vedení udělalo maximum, aby lidé měli příležitost, možnost a chuť znovu sociální demokracii volit. Udělali jme řadu dobrých věcí, ale bohužel řadu aktuálních politických témat překrývala takzvaná kauza Miroslava Pocheho a jeho kandidatury na ministerstvo zahraničních věcí. Vyjadřovali se k ní i lidé, kteří se běžně politikou neživí a ani je nemusí zajímat. Viděl jsem to na svých cestách na českém a moravském – v uvozovkách – venkově. Lidé mnohem více než témata, která se jich bytostně dotýkají, akcentovali téma, které ani tématem nebylo.Myslíte tedy, že výsledek komunálních voleb ovlivnila situace se jmenováním Miroslava Pocheho?Ptejme se voličů, já jim do hlavy nevidím. Spíše vycházím z toho, co jsem slyšel při svých cestách za podporou jednotlivých kandidátů.V Senátu ze 12 obhajovaných křesel postoupilo do druhého kola pět kandidátů. Pravděpodobně tak strana ztratí předsedu horní komory parlamentu...Nechtěl bych teď spekulovat. Senát je sbor politických stran a hnutí, ale také nezávislých osobností. Bude záležet na tom, co se současnému vedení Senátu, tedy Milanu Štěchovi nebo sociální demokracii, podaří vyjednat. Počkejme na druhé kolo senátních voleb. Teprve potom bude známo, kdo se tam dostane. S nimi bude potřeba jednat dál. Roman Onderka prý odhadoval, že postoupí méně než pět senátorů, Jan Hamáček zase doufal v alespoň šest. Jaký byl váš odhad? Nechci být generál po bitvě, ale přiznám se, že moje úvaha byla kolem pěti senátorů. Ale prosím, neberte to tak, že jsem ten generál. Zkrátka jsem si dokázal představit, že to bude těch pět. A musím dokonce jsem se trefil i ve svém interním odhadu jmen, které postoupí do druhého kola.Michal Hašek řekl, že sociální demokracie je krůček od politického hřbitova. Souhlasíte s ním? Pochopitelně. S tím nejde nesouhlasit. Ale kvůli tomu děláme s Janem Hamáčkem maximum.", "authors": "Autor: Dominika Hromková", "disc_nr": 166, "discussion_url": "https://zpravy.idnes.cz/diskuse.aspx?iddiskuse=A181006_223300_volby_dh&razeni=time", "images": []},
{"opener": "Od úterý se v pražských Hlubočepích pátralo po smrtelně jedovaté mambě zelené, která utekla své majitelce. Odchytit se ji podařilo až v pátek večer. Slovenská policie zveřejnila video z razie proti podezřelým z vraždy novináře Jána Kuciaka. Pražští taxikáři vyzráli na letištní poplatky, Poláci hazardovali s životy lidí na slovenské dálnici a pilot boeingu předvedl nevídaný manévr.", "text": "Smrtelně jedovatá mamba zelená byla na svobodě už několik dní, když operátorovi policejní linky zavolala v pátek po páté hodině večer žena, že hada zahlédla. Na místo přijeli odborníci a za necelou hodinu plaza chytili. Ve videu se můžete podívat, jak odchyt smrtícího hada probíhal.Misc.video({ data: \"//servix.idnes.cz/media/video.aspx?idvideo=V181006_075302_prahah_nav&idrubriky=domaci&idostrova=zpravodaj&idclanku=A181007_132128_domaci_rejs\", ratio: 16/9 });<h2>VIDEO: Herpetolog lapil prudce jedovatou mambu rukama</h2><strong>Pro zobrazení videa musíte mít zapnutou podporu JavaScriptu</strong>Podezřelé z přípravy vraždy novináře Jána Kuciaka zadržela elitní jednotka slovenské policie. Kriminalisté při raziích zajistili dvě zbraně, zásobník i náboj, který se shoduje se střelivem použitým najatým vrahem. Video ze zásahu policie v pondělí zveřejnila na svém Facebooku. Misc.video({ data: \"//servix.idnes.cz/media/video.aspx?idvideo=V181001_124851_webtv_kov&idrubriky=domaci&idostrova=zpravodaj&idclanku=A181007_132128_domaci_rejs\", ratio: 16/9 });<h2>VIDEO: Zásah proti podezřelým z vraždy Jána Kuciaka</h2><strong>Pro zobrazení videa musíte mít zapnutou podporu JavaScriptu</strong>Zatímco někteří taxikáři a přepravci přelepují značky na autech, aby se jim závora na Letišti Václava Havla otevírala zdarma, jiní vynalezli elegantnější řešení, jak se poplatku vyhnout. Cestující jednoduše vysadí na zastávce autobusu. Podle mluvčího letiště Romana Pacvoně tím ale ohrožují zdraví pasažérů.Misc.video({ data: \"//servix.idnes.cz/media/video.aspx?idvideo=V181004_172907_prahah_smls&idrubriky=domaci&idostrova=zpravodaj&idclanku=A181007_132128_domaci_rejs\", ratio: 16/9 });<h2>VIDEO: Taxikáři znovu vyzráli na letiště. Cestující ušetří</h2><strong>Pro zobrazení videa musíte mít zapnutou podporu JavaScriptu</strong>SMLSALOVINY aneb jak žít a přežítSledovat další díly na iDNES.tvBoeing se těsně po opuštění ranveje nebezpečně rozhoupal do obou stran. Pro některé nepředstavitelný a děsivý zážitek. Ve skutečnosti jde jen o pozdrav. Zamávání pilota nákladního boeingu 747-8 Cargolux při opouštění letiště Paine field v USA sice vypadá nebezpečně, ale je to běžné rozloučení s opuštěnou destinací.Misc.video({ data: \"//servix.idnes.cz/media/video.aspx?idvideo=V181003_115101_webtv_salv&idrubriky=domaci&idostrova=zpravodaj&idclanku=A181007_132128_domaci_rejs\", ratio: 16/9 });<h2>VIDEO: Pilot boeingu udělal po vzlétnutí šílený manévr</h2><strong>Pro zobrazení videa musíte mít zapnutou podporu JavaScriptu</strong>Smrtí nevinného otce od rodiny skončilo „závodění“ tří Poláků v luxusních vozech Porsche, Ferrari a Mercedes na Slovensku. Jedno z aut totiž čelně narazilo do škodovky v protisměru. Tragická nehoda se stala u města Dolný Kubín, informovala o ní slovenská a polská média a zveřejnila i záběry srážky.Misc.video({ data: \"//servix.idnes.cz/media/video.aspx?idvideo=V181001_062816_zpravodaj_nav&idrubriky=domaci&idostrova=zpravodaj&idclanku=A181007_132128_domaci_rejs\", ratio: 16/9 });<h2>VIDEO: Poláci v luxusních autech „závodili“. Zavinili tragédii</h2><strong>Pro zobrazení videa musíte mít zapnutou podporu JavaScriptu</strong>", "authors": "Autor: iDNES.cz", "disc_nr": 1, "discussion_url": "https://zpravy.idnes.cz/diskuse.aspx?iddiskuse=A181007_132128_domaci_rejs&razeni=time", "images": []}
]